old/org-page-config.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2021-09-16 四 17:11 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>org-page 配置</title>
<meta name="author" content="shirui" />
<meta name="description" content="doom下的org-page配置" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/style.css" type="text/css"/>
            <link rel="stylesheet" href="/static/org.css" type="text/css"/>
            <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
            <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
</head>
<body>
<div id="preamble" class="status">
<div class="header">
            <a href="https://lampze.github.io">lampze's Blog</a>
            <span id="post-date" style="float: right">2020-03-04 三 00:00</span>
            </div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">org-page 配置</h1>
</header><div id="outline-container-orgccea1ed" class="outline-2">
<h2 id="orgccea1ed">前言</h2>
<div class="outline-text-2" id="text-orgccea1ed">
<p>
以前用过几个博客的生成器，感觉都太复杂，太笨重了，而且对 org 的支持也不好，最后还是
换到了 org-page
</p>
</div>
</div>
<div id="outline-container-org60eb3d3" class="outline-2">
<h2 id="org60eb3d3">Doom 的配置</h2>
<div class="outline-text-2" id="text-org60eb3d3">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #556b2f;">;; </span><span style="color: #556b2f;">&#23433;&#35013;org-page</span>
(package! org-page)
<span style="color: #556b2f;">;; </span><span style="color: #556b2f;">&#37197;&#32622;</span>
(def-package! org-page
  <span style="font-weight: bold;">:config</span>
  (setq op/repository-directory <span style="color: #8a3b3c;">"~/codehome/lampze.github.io"</span>
        op/repository-org-branch <span style="color: #8a3b3c;">"source"</span>
        op/repository-html-branch <span style="color: #8a3b3c;">"master"</span>
        <span style="color: #556b2f;">;; </span><span style="color: #556b2f;">&#22240;&#20026;Doom&#23433;&#35013;&#26102;&#26159;&#29992;&#36719;&#38142;&#25509;&#65292;&#25152;&#20197;&#25105;&#20204;&#35201;&#25226;org-page&#30340;&#30495;&#23454;&#30446;&#24405;&#35774;&#32622;&#22909;</span>
        op/theme-root-directory <span style="color: #8a3b3c;">"/home/shirui/.emacs.d/.local/straight/repos/org-page/themes"</span>
        op/load-directory <span style="color: #8a3b3c;">"/home/shirui/.emacs.d/.local/straight/repos/org-page/"</span>
        op/personal-github-link <span style="color: #8a3b3c;">"https://github.com/lampze/"</span>
        op/site-domain <span style="color: #8a3b3c;">"https://lampze.github.io/"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdc595ca" class="outline-2">
<h2 id="orgdc595ca">org-page 的坑</h2>
<div class="outline-text-2" id="text-orgdc595ca">
<ol class="org-ol">
<li>文章的名字不能使用中文</li>
<li>自动生成的 org 文件有两个 title，需要删掉一个，可能是 Doom的问题</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<script type="text/javascript" src="/static/main.js"></script>
            <center id="modi-date">2021-09-16 四 17:11</center>
</div>
</body>
</html>
